while True:
    if input() == 'exit':
        break
    else:
        a = float(input('Введите свой вес, кг:'))
        b = float(input('Введите свой рост, см:'))
        e = input('Введите свой пол:')
        m = float(input('Введите свой возраст:'))
        c = a / ((b * 0.01)**2)
        print("Ваш имт:", round(c))
        d = ['=', '=', '=', '=', '=', '=', '=', '=', '=', '=', '=', '=']
        d[round((round(c)-21)/3)] = '|'
        print('20'+''.join(d)+'56')
        if c < 20 and e == 'мужской' and m <= 44:
            print('Недостаточный вес, требуется больше питаться')
        elif 20 <= c <= 26 and e == 'мужской' and m <= 44:
            print('Нормальный вес')
        elif c > 26 and e == 'мужской' and m <= 44:
            print('Избыточнй вес')
        elif c < 22 and e == 'мужской' and m > 44:
            print('Недостаточный вес, требуется больше питаться')
        elif 22 <= c <= 27 and e == 'мужской' and m > 44:
            print('Нормальный вес')
        elif c > 27 and e == 'мужской' and m > 44:
            print('Избыточнй вес')
        elif c < 19 and e == 'женский' and m <= 44:
            print('Недостаточный вес, требуется больше питаться')
        elif 19 <= c <= 24 and e == 'женский' and m <= 44:
            print('Нормальный вес')
        elif c > 26 and e == 'женский' and m <= 44:
            print('Избыточнй вес')
        elif c < 20 and e == 'женский' and m > 44:
            print('Недостаточный вес, требуется больше питаться')
        elif 20 <= c <= 25 and e == 'мужской' and m > 44:
            print('Нормальный вес')
        elif c > 25 and e == 'женский' and m > 44:
            print('Избыточнй вес')